import os
import time
import random

from input_handler import get_char



def show_title_screen():
    os.system('cls' if os.name == 'nt' else 'clear')
        
    print("█▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀█")
    print("█                                                                                                              █")
    print("█                                ███████╗███████╗ ██████╗ █████╗ ██████╗ ███████╗                              █")
    print("█                                ██╔════╝██╔════╝██╔════╝██╔══██╗██╔══██╗██╔════╝                              █")
    print("█                                █████╗  ███████╗██║     ███████║██████╔╝█████╗                                █")
    print("█                                ██╔══╝  ╚════██║██║     ██╔══██║██╔═══╝ ██╔══╝                                █")
    print("█                                ███████╗███████║╚██████╗██║  ██║██║     ███████╗                              █")
    print("█                                ╚══════╝╚══════╝ ╚═════╝╚═╝  ╚═╝╚═╝     ╚══════╝                              █")
    print("█                                                                                                              █")
    print("█                                                                                                              █")
    print("█                                                                                                              █")
    print("█                                                                                                              █")
    print("█                                Вы - серийный убийца на пожизненном заключении                                █")
    print("█                          В тюрьме произошел сбой, открывший все двери, кроме одной...                        █")
    print("█                           Найди три ключа и соверши побег. Но будет ли это так легко?                        █")
    print("█                                                                                                              █")
    print("█                                                                                                              █")
    print("█                                                                                                              █")
    print("█                                                     .-.                                                      █")
    print("█                                                    (҂`_´)                                                    █")
    print("█                                                   <,︻╦╤─                                                    █")
    print("█                                                    _/ \_                                                     █")
    print("█                                                                                                              █")
    print("█                                         ▄█▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀█▄                                         █")
    print("█                                       ▄█▀                          ▀█▄                                       █")
    print("█                                     ▄█▀     НАЖМИТЕ ЛЮБУЮ КЛАВИШУ    ▀█▄                                     █")
    print("▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀                                  ▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀")

    
    get_char()




def transition_to_game():
    title_screen_lines = [
        "█▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀█",
        "█                                                                                                              █",
        "█                                ███████╗███████╗ ██████╗ █████╗ ██████╗ ███████╗                              █",
        "█                                ██╔════╝██╔════╝██╔════╝██╔══██╗██╔══██╗██╔════╝                              █",
        "█                                █████╗  ███████╗██║     ███████║██████╔╝█████╗                                █",
        "█                                ██╔══╝  ╚════██║██║     ██╔══██║██╔═══╝ ██╔══╝                                █",
        "█                                ███████╗███████║╚██████╗██║  ██║██║     ███████╗                              █",
        "█                                ╚══════╝╚══════╝ ╚═════╝╚═╝  ╚═╝╚═╝     ╚══════╝                              █",
        "█                                                                                                              █",
        "█                                                                                                              █",
        "█                                                                                                              █",
        "█                                                                                                              █",
        "█                                Вы - серийный убийца на пожизненном заключении                                █",
        "█                          В тюрьме произошел сбой, открывший все двери, кроме одной...                        █",
        "█                           Найди три ключа и соверши побег. Но будет ли это так легко?                        █",
        "█                                                                                                              █",
        "█                                                                                                              █",
        "█                                                                                                              █",
        "█                                                     .-.                                                      █",
        "█                                                    (҂`_´)                                                    █",
        "█                                                   <,︻╦╤─                                                    █",
        "█                                                    _/ \_                                                     █",
        "█                                                                                                              █",
        "█                                         ▄█▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀█▄                                         █",
        "█                                       ▄█▀                          ▀█▄                                       █",
        "█                                     ▄█▀     НАЖМИТЕ ЛЮБУЮ КЛАВИШУ    ▀█▄                                     █",
        "▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀                                  ▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀"
    ] 

    def clear_screen():
        os.system('cls' if os.name == 'nt' else 'clear')

    for _ in range(3):
        clear_screen()
        time.sleep(0.15)
        for line in title_screen_lines:
            print(line)
        time.sleep(0.15)

    remaining_lines = title_screen_lines.copy()
    line_indices = list(range(len(remaining_lines)))

    while line_indices:
        index = random.choice(line_indices)
        line_indices.remove(index)
        
        clear_screen()
        for i in range(len(title_screen_lines)):
            if i in line_indices:
                print(title_screen_lines[i])
            else:
                print(" " * len(title_screen_lines[i]))  
        time.sleep(0.01)  

    clear_screen()